SigninLogs
| where UserPrincipalName contains "FixMe"
| where IPAddress contains "FixMe"
| project TimeGenerated, IPAddress, ResultType, ResultDescription, UserAgent, Location, AppDisplayName, UserPrincipalName, UserId, AuthenticationRequirement, DeviceDetail, AuthenticationDetails, Id
